Documents/Д_ЗаявкаНаАвансовыйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Д_ЗаявкаНаАвансовыйОтчет</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяЗадача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийБизнесПроцесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Comment>Корректируется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДСтрокиДокОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезЗаявкиНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратДенежныхСредствБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоПодОтчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>350</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвПроект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредставительскиеРасходы</v8:Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтрокиЗаявкиНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УИДСтрокиДокОснования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВнутренниеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Д_ЗаявкаНаАвансовыйОтчет/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаОплату") Тогда
		// Заполнение шапки
		Предприятие = ДанныеЗаполнения.Предприятие;
		ДокОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		ДатаПолучения = ДанныеЗаполнения.Дата;
		
		ОтобранныеСтроки = ДанныеЗаполнения.ЗаявкаБезнал.НайтиСтроки(Новый Структура("ВыдачаВПодОтчет", Истина));
		Если ОтобранныеСтроки.Количество() = 1 Тогда
			ПодотчетноеЛицо = ОтобранныеСтроки[0].Контрагент;	
			УИДСтрокиДокОснования = ОтобранныеСтроки[0].УИДСтроки;
			
			НоваяСтрока = Затраты.Добавить();
			НоваяСтрока.Предприятие = ОтобранныеСтроки[0].ЦФО;
			НоваяСтрока.Подразделение = ОтобранныеСтроки[0].Подразделение;
			НоваяСтрока.ИнвПроект = ОтобранныеСтроки[0].ИнвПроект;
			НоваяСтрока.Статья = ОтобранныеСтроки[0].СтатьяДДС;
			НоваяСтрока.Сумма = ОтобранныеСтроки[0].СуммаДДС;
			НоваяСтрока.Описание = ОтобранныеСтроки[0].НазначениеПлатежа;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование") Тогда
		Предприятие = ДанныеЗаполнения.Предприятие;
		ДокОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.Сумма;
		ДатаПолучения = ДанныеЗаполнения.Дата;
		
		ПодотчетноеЛицо = ДанныеЗаполнения.Контрагент;	
		//УИДСтрокиДокОснования = ОтобранныеСтроки[0].УИДСтроки;
		Если ДанныеЗаполнения.ТабличнаяЧасть.Количество() Тогда
			Для каждого ТекСтрока Из ДанныеЗаполнения.ТабличнаяЧасть Цикл
				НоваяСтрока = Затраты.Добавить();
				НоваяСтрока.Предприятие = ТекСтрока.Предприятие;
				НоваяСтрока.Подразделение = ТекСтрока.Подразделение;
				НоваяСтрока.ИнвПроект = ТекСтрока.ИнвПроект;
				НоваяСтрока.Статья = ТекСтрока.СтатьяДДС;
				НоваяСтрока.Сумма = ТекСтрока.Сумма;
				НоваяСтрока.Описание = ДанныеЗаполнения.НазначениеПлатежа;
			КонецЦикла; 
		Иначе
			НоваяСтрока = Затраты.Добавить();
			НоваяСтрока.Предприятие = ДанныеЗаполнения.ЦФО;
			НоваяСтрока.Подразделение = ДанныеЗаполнения.Подразделение;
			НоваяСтрока.ИнвПроект = ДанныеЗаполнения.ИнвПроект;
			НоваяСтрока.Статья = ДанныеЗаполнения.СтатьяДДС;
			НоваяСтрока.Сумма = ДанныеЗаполнения.Сумма;
			НоваяСтрока.Описание = ДанныеЗаполнения.НазначениеПлатежа;
		КонецЕсли;
		
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Затраты.Итог("Сумма") + ВозвратДенежныхСредств;
	//при установки пометки удаления проверка на состояние согласования
	
	//Запишем док. основание если одна заявка на оплату
	ЗаписатьДокОснование();
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.ПолучитьЭлементПредопределенный("ЗаявкаНаАвансовыйОтчет");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ТекущаяЗадача = "";
	Автор = "";
	ТекущийБизнесПроцесс = "";
	НеСогласована = Ложь;
	Доступность = Ложь;
	УИДСтрокиДокОснования = "";
	СтрокиЗаявкиНаОплату.Очистить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Движения.Бюджетный.Записывать = Истина;
	//Для Каждого ТекСтрокаЗаявка Из Затраты Цикл
	//	// регистр Бюджетный 
	//	Движение = Движения.Бюджетный.Добавить();
	//	Движение.СчетДт = ПланыСчетов.Учетный.Счет7601();
	//	Движение.СчетКт = ПланыСчетов.Учетный.Счет5001();
	//	Движение.ПодразделениеКт = ТекСтрокаЗаявка.Подразделение;
	//	Движение.Период = Дата;
	//	Движение.Предприятия = ТекСтрокаЗаявка.Предприятие;
	//	Движение.СценарийПлана = Справочники.СценарииПланирования.ПланПоЗаявкам;
	//	Движение.Сумма = ТекСтрокаЗаявка.Сумма;
	//	Движение.Содержание = ТекСтрокаЗаявка.Описание;
	//	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = ТекСтрокаЗаявка.Статья;
	//	//Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Контрагенты", Истина)] = ТекСтрокаЗаявка.Контрагент;
	//	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//ищем дубли
	Если ЗначениеЗаполнено(ДокОснование) И ЗначениеЗаполнено(УИДСтрокиДокОснования) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Д_ЗаявкаНаАвансовыйОтчетСтрокиЗаявкиНаОплату.Ссылка
		|ИЗ
		|	Документ.Д_ЗаявкаНаАвансовыйОтчет.СтрокиЗаявкиНаОплату КАК Д_ЗаявкаНаАвансовыйОтчетСтрокиЗаявкиНаОплату
		|ГДЕ
		|	Д_ЗаявкаНаАвансовыйОтчетСтрокиЗаявкиНаОплату.УИДСтрокиДокОснования = &УИДСтрокиДокОснования
		|	И Д_ЗаявкаНаАвансовыйОтчетСтрокиЗаявкиНаОплату.ДокОснование = &ДокОснование
		|	И НЕ Д_ЗаявкаНаАвансовыйОтчетСтрокиЗаявкиНаОплату.Ссылка = &Ссылка
		|	И Д_ЗаявкаНаАвансовыйОтчетСтрокиЗаявкиНаОплату.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Если УИДСтрокиДокОснования = "Несколько строк..." Тогда
			
			Для Каждого Строка Из СтрокиЗаявкиНаОплату Цикл
				
				Запрос.УстановитьПараметр("УИДСтрокиДокОснования", Строка.УИДСтрокиДокОснования);
				Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				Если Выборка.Количество() Тогда
					сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					"По строке заявки " + Строка.НомерСтроки + " уже существуют авансовые отчеты.",
					,
					,
					"УИДСтрокиДокОснования",
					Отказ);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Запрос.УстановитьПараметр("УИДСтрокиДокОснования", УИДСтрокиДокОснования);
			Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Если Выборка.Количество() Тогда
				сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				"По строке заявки уже существуют авансовые отчеты.",
				,
				,
				"УИДСтрокиДокОснования",
				Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ТекСтрока Из Затраты Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Сумма) И НЕ ЗначениеЗаполнено(ТекСтрока.СуммаБУ) Тогда
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			"Не заполнена СуммаУУ и СуммаБУ.",
			"Затраты",
			ТекСтрока.НомерСтроки,
			"Сумма",
			Отказ);
		КонецЕсли;
		
	КонецЦикла; 
	
	
КонецПроцедуры

Процедура ЗаписатьДокОснование()
	
	ТаблицаЗаявок = СтрокиЗаявкиНаОплату.Выгрузить(, "ДокОснование");
	ТаблицаЗаявок.Свернуть("ДокОснование");
	Если ТаблицаЗаявок.Количество() = 1 Тогда
		ДокОснование = ТаблицаЗаявок[0].ДокОснование; 	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.ВнутренниеДокументы.СоздатьЗаписьЖурнала(ЭтотОбъект);
КонецПроцедуры
